{
  "https://www.seek.com.au/job/86415956?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">Data Engineer</h1></div></div><div><div><div><div><div><span><a href=\"/Data-Engineer-jobs/in-Wollongong-NSW-2500\">Wollongong, Wollongong, Illawarra &amp; South Coast NSW</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-information-communication-technology/other\">Other (Information &amp; Communication Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Data-Engineer-jobs/full-time\">Full time</a></span></div></div></div><div><div><div><span>$100,000 – $110,000 per year</span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/86415956/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div><p>At Scalapay, we're shaping a<strong>culture</strong>with high standards, independent and critical thought,<strong>innovation, ownership, and continuous learning</strong>. We operate in a<strong>fast-moving, tech-driven environment</strong>, and we're looking for people who<strong>thrive in change, think boldly, and take initiative.</strong></p><p>If you're ready to<strong>put your potential to the test</strong>in a hiring process designed to spotlight exceptional talent, this is your chance to stand out and grow<strong>with one of Europe's most ambitious fintech teams</strong>.</p><p><em>#MakeItHappen #PlayAsATeam #StayCurious #FocusOnCustomer.</em></p><p><strong>About the Role</strong></p><p>You’ll help us<strong>design, build, and scale</strong>a cutting-edge data ecosystem that powers everything from analytics to AI-driven decision-making. We believe in treating data as a product and applying strong software engineering practices to everything we build. Your work will directly enable product teams, analysts, and business leaders to move faster and smarter.</p><p>If you want to work with<strong>modern data tools</strong>,<strong>AI-powered solutions</strong>, and<strong>streaming architectures</strong>in a company that values autonomy, innovation, and impact — this is your opportunity.</p><h2><strong>What You’ll Do</strong></h2><ul><li><p>Craft next-gen<strong>ETL/ELT pipelines</strong>with dbt, Apache Kafka, Apache Flink &amp; CDC.</p></li><li><p>Shape our<strong>Snowflake data warehouse</strong>for speed, scalability, and insight.</p></li><li><p>Automate deployments with<strong>Terraform</strong>in a cloud-native environment.</p></li><li><p>Build smart integrations from APIs, databases &amp; third-party platforms.</p></li><li><p>Write clean, scalable<strong>Python</strong>code for data transformations &amp; utilities.</p></li><li><p>Leverage<strong>AWS services</strong>(S3, Lambda, API Gateway, SageMaker).</p></li><li><p>Help evolve our<strong>LLM-powered internal Slack bot</strong>for natural language data access.</p></li></ul><h2><strong>Projects You Might Work On</strong></h2><ul><li><p><strong>AI-powered BI assistant</strong>delivering instant insights from our warehouse.</p></li><li><p>High-speed<strong>data streaming pipelines</strong>for real-time analytics.</p></li><li><p>Custom<strong>integration endpoints</strong>for diverse data sources.</p></li><li><p><strong>ML-driven fraud prevention</strong>and personalised recommendation engines.</p></li></ul><h2><strong>About You</strong></h2><ul><li><p>2–3 years in<strong>data engineering</strong>or backend roles with strong pipeline experience.</p></li><li><p>Advanced<strong>SQL</strong>&amp; dimensional modelling skills.</p></li><li><p>Experience with<strong>Snowflake</strong>(or similar), dbt, Kafka, Flink.</p></li><li><p><strong>Python</strong>proficiency &amp; Infrastructure-as-Code know-how (Terraform).</p></li><li><p>Familiar with<strong>AWS</strong>&amp; modern DevOps practices.</p></li><li><p>Bonus points for:<strong>Airflow/Dagster</strong>, CDC tools, AI apps, data governance.</p></li></ul><h2><strong>Why You’ll Love It Here</strong></h2><ul><li><p>Be part of a<strong>passionate, collaborative, and innovative team</strong>.</p></li><li><p>Directly shape how data powers every decision at Scalapay.</p></li><li><p>Work with<strong>cutting-edge tools</strong>and<strong>emerging AI technologies</strong>.</p></li><li><p>Enjoy<strong>flexible work options</strong>— office, hybrid, or remote.</p></li><li><p><strong>Grow</strong>your skills with mentorship, training &amp; real ownership of your work.</p></li></ul><ul><li><p><strong>Competitive</strong>Salary packages including ESOP and onsite parking provided</p></li></ul><p>Want to learn more? Don't hesitate to explore our Careers website and LinkedIn pages.</p><p><em>We believe in the power of diversity: Scalapay is an Equal Opportunity Employer for any minority, disability, gender identity or sexual orientation.</em></p></div></div></div></section><section><div><h2>Employer questions</h2><div><span>Your application will include the following questions:</span><ul><li><div><span>Which of the following statements best describes your right to work in Australia?</span></div></li><li><div><span>How many years' experience do you have as a Data Engineer?</span></div></li><li><div><span>Have you completed a qualification in computer science?</span></div></li></ul></div></div></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86350269?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">Engineering Data Analyst - multiple opportunities</h1><div><div><span><span>2.8</span></span><span>·</span></div></div></div></div><div><div><div><div><div><span><a href=\"/Data-Analyst-jobs/in-Adelaide-SA-5000\">Adelaide SA</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-consulting-strategy/analysts\">Analysts (Consulting &amp; Strategy)</a></span></div></div></div><div><div><div><span><a href=\"/Data-Analyst-jobs/full-time\">Full time</a></span></div></div></div><div><div><div><span>Attractive Rem + 0.6 FTE or More</span></div></div></div></div></div></div><div><section><div><div><div><strong>About ElectraNet</strong><p>ElectraNet builds, owns, operates and maintains the high voltage electricity transmission network which delivers the energy South Australians rely on to power our homes, businesses and communities. Our employees describe our culture as one that is supportive, inclusive, and community-oriented, where we genuinely want each other to succeed.</p><strong>Employee Benefits</strong><p>ElectraNet is committed to empowering our people and recognising their contribution with a competitive remuneration package including a base salary from $109,400 per annum + 12% superannuation, and eligibility for a performance bonus of up to 15% in FY25/26. We are also proud to offer:<br/><br/></p><ul><li>Flexible work practices to support work-life balance</li><li>15 days personal/carers leave per year</li><li>16 weeks paid parental leave for the primary carer or 4 weeks as the secondary carer</li><li>Additional paid volunteering and office closure leave</li><li>Flexibility to utilise public holiday leave entitlements for other cultural celebrations</li><li>Employee Assistance Program for your personal and professional well-being</li></ul><p><br/>Visit our careers page to </p><strong>The Opportunity</strong><p>Turn data into action—optimise engineering practices, cut down manual work, and boost documentation quality with smart, scalable solutions.<br/><br/>ElectraNet is expanding, and we're on the lookout for innovative minds who thrive on solving complex problems and improving how things are done. The Engineering Data Analyst plays a key role in supporting the delivery of project engineering services by developing and maintaining technical processes and systems. These are newly created roles designed to support our Project Engineering teams by enhancing technical processes and systems that drive project success.<br/><br/>Success in this role is defined by a proactive approach to understanding team needs and uncovering areas for improvement. The Analyst applies programming, mathematical/statistical, and data analysis skills to design fit-for-purpose solutions that enhance operational effectiveness.<br/><br/>Key Responsibilities:<br/><br/></p><ul><li>Support project engineering delivery by closing out Asbuilt documentation and ensuring compliance.</li><li>Drive efficiency by automating repetitive engineering tasks using tools like Power Automate and leveraging programming and data science techniques.</li><li>Apply data analysis and mathematical concepts to investigate team issues and improve response times, aligned with Responsible AI and Data Governance frameworks.</li><li>Collaborate proactively with team members to identify opportunities, deliver scalable solutions, and support compliance reporting.</li></ul><strong>About You</strong><p>You're a curious, analytical problem-solver with a strong foundation in programming and a passion for improving systems. You bring:<br/><br/></p><ul><li>A passion for data-driven problem solving and a sharp eye for identifying inefficiencies in engineering workflows</li><li>Demonstrated programming skills (Python, C, or similar)</li><li>Experience applying data science principles to practical challenges</li><li>A proactive mindset with strong investigative and critical thinking skills</li><li>Proven ability to automate repetitive tasks and streamline workflows</li><li>Experience in project support or controls, ideally in a corporate or engineering environment</li><li>Strong attention to detail and a continuous improvement focus</li><li>Tertiary qualification in Engineering, Computer Science, Data Science or equivalent</li></ul><p><br/>We understand the importance of work-life balance and are pleased to offer flexible working arrangements. We welcome applications from candidates seeking part-time employment (0.6 FTE or greater).<br/><br/></p><strong>How To Apply</strong><p>Please apply online via our careers page before Saturday, 30 August 2025. Interested applicants are encouraged to apply as soon as possible, as interviews and appointments may occur prior to the closing date. Position Descriptions can be obtained by clicking here﻿.</p><p><br/>We strongly encourage Aboriginal and Torres Strait Islander people to apply. ElectraNet is committed to creating a diverse and inclusive workplace. We value the unique perspectives and experiences that Aboriginal and Torres Strait Islander people bring to our team.<br/><br/>Successful applicants will be required to undergo background checks. These checks may include global criminal history checks, reference checks, and validation of qualifications, employment history, Australian work rights, and any additional checks depending on the role.</p><p><br/>#LI-VR1</p></div></div></div></section><section></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86406417?type=promoted&ref=search-standalone&origin=cardTitle": {
    "job_content": "html <html><head><title>Browser Upgrade | SEEK</title><link href=\"/static/shared-web/favicon-4e1897dfd0901e8a3bf7e604d3a90636.ico\"/><link href=\"/static/shared-web/iphone-7c4d7dcb05fece466d8901945e36bbaa.png\"/><link href=\"/static/shared-web/ipad-96988dd1c0902fd20b34ce260d03729b.png\" sizes=\"76x76\"/><link href=\"/static/shared-web/iphoneRetina-c772d091f011ef7ce26f631360de4907.png\" sizes=\"120x120\"/><link href=\"/static/shared-web/ipadRetina-8a06978f3bf7985f413edcb5113c9783.png\" sizes=\"152x152\"/><meta content=\"https://www.seek.com.au/static/shared-web/banner-eef04f549748a012d18cb7b873a9a1a6.png\" name=\"twitter:image\"/><meta content=\"summary\" name=\"twitter:card\"/><meta content=\"@seekjobs\" name=\"twitter:site\"/><meta content=\"https://www.seek.com.au/static/shared-web/banner-eef04f549748a012d18cb7b873a9a1a6.png\" property=\"og:image\"/><meta content=\"1200\" property=\"og:image:width\"/><meta content=\"630\" property=\"og:image:height\"/><meta content=\"website\" property=\"og:type\"/><meta content=\"SEEK\" property=\"og:site_name\"/><meta content=\"en_GB\" property=\"og:locale\"/><link/><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1\" name=\"viewport\"/><link/><link/><link/><link as=\"script\"/><link as=\"script\"/><link as=\"script\"/><link as=\"script\"/><link as=\"script\"/><link as=\"script\"/></head><body><div><div><div><div><div><header></header><div><h1>Browser Upgrade</h1><div><h3>Why am I seeing this page?</h3><span>Youâre seeing this page because your browser (the program you use to browse the web) version is unsupported.</span><span>We offer limited support to older browsers as they may prevent you from being able to see or access all the functionality on our website.</span></div><div><h3>How do I upgrade?</h3><span>Upgrading is free and easy, and ensures that SEEK and other websites run more efficiently.</span><span>Click on the link of the browser you use to see further information on how to upgrade.</span></div><div><div><div><a></a><h4>Microsoft Edge</h4><a><span>Upgrade</span></a></div><div><a></a><h4>Firefox</h4><a><span>Upgrade</span></a></div><div><a></a><h4>Google Chrome</h4><a><span>Upgrade</span></a></div><div><a></a><h4>Safari</h4><a><span>Upgrade</span></a></div></div></div></div><div><span>Continue and remind me later</span></div><div><span>Â© SEEK. All rights reserved.</span></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/85925573?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">ML/AI Engineer</h1><div><div><span><span>3.3</span></span><span>·</span></div></div></div></div><div><div><div><div><div><span><a href=\"/Artificial-Intelligence-Engineer-jobs/in-Sydney-NSW-2000\">Sydney NSW</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-engineering/other\">Other (Engineering)</a></span></div></div></div><div><div><div><span><a href=\"/Artificial-Intelligence-Engineer-jobs/full-time\">Full time</a></span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/85925573/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div><p><strong>BizCover who?</strong></p><p>You haven’t heard of us?</p><p>We dominate the SME business insurance market by having an online platform that makes comparing and buying business insurance a super easy process. Not to toot our own horn but we have been recognized in Deloittes fast 50 companies as one of the fastest growing technology companies and Westpac’s top 20 businesses of tomorrow - #killingit</p><p><strong>About The Team:</strong></p><p><strong>BizAnalytics</strong>is a trusted internal brand, and a trusted team. We’re part of the wider<strong>Innovation and Growth</strong>team, and are jointly responsible for growth, and um.. innovation! Primarily, we’re about improving customer journeys at all stages of the insurance lifecycle, bringing a customer and product lens to BizCover’s decision making, to grow at scale in our Australian, and overseas, businesses.</p><p>We span the whole value chain, and a complete set of data skills, and drive value through insights, driving change, enabling better management decisions, and automating decisions with AI (and Machine Learning) live into our business</p><p><strong>The Role:</strong></p><p>We are looking for a talented ML/AI Engineer to join our business insurance company and drive the operationalization of machine learning (ML) and AI Solutions. You will be part of the data science team inside Analytics, working alongside data scientists, operations excellence manager, and collaborating across Operations, Risk, TechOps and Cyber to engineer robust, resilient AI and ML solutions.</p><br/><br/><strong>Requirements</strong><br/><br/>Roles and Responsibilities:<ul><li>Partner with the Data Scientist to operationalize ML models and build AI-powered processes, ensuring seamless deployment of business products like risk assessment tools, claims automation, and customer-facing insurance solutions.</li><li>Design, build, and maintain scalable ML pipelines for data processing, model training, validation, and deployment using modern frameworks and tools.</li><li>Implement and manage continuous integration/continuous deployment (CI/CD) processes for ML systems to ensure reliability and rapid iteration of products.</li><li>Monitor and optimize the performance, scalability, and stability of deployed ML models and GPT applications in production environments.</li><li>Develop and maintain infrastructure for A/B testing ML models to validate improvements before full production deployment.</li><li>Hands-on experience with LLM deployment and integration of foundation models into business applications.</li><li>Collaborate with cross-functional teams to integrate AI products into existing business systems, ensuring compatibility and efficiency.</li><li>Automate model retraining, versioning, and evaluation processes to keep products aligned with evolving business needs and data trends.</li><li>Troubleshoot and resolve issues related to system performance, data quality, or production failures, minimizing downtime and risk.</li><li>Ensure all AI operations comply with data privacy, security, and regulatory standards relevant to the insurance industry.</li></ul>Your Experience:<ul><li>3+ years of experience in machine learning engineering or MLOps, with a focus on deploying and managing ML models in production.</li><li>Proficiency in programming languages like Python and experience with MLOps tools (e.g., Kubeflow, MLflow, Airflow, or Docker).</li><li>Proficiency in SQL and experience working with large datasets</li><li>Hands-on experience building and maintaining ML pipelines, including data preprocessing, model deployment, and monitoring.</li><li>Familiarity with CI/CD practices and cloud platforms (e.g., AWS, Azure, Google Cloud) for scaling ML solutions.</li><li>Previous collaboration with data scientists or engineering teams to transition ML prototypes into production-ready systems.</li><li>Knowledge of the insurance industry (e.g., risk modeling, claims processing) is a plus but not required.</li><li>Strong problem-solving skills and the ability to thrive in a dynamic, fast-paced environment.</li><li>Excellent communication skills to explain technical concepts to non-technical stakeholders.</li><li>Bachelor’s degree in computer science, Engineering, Data Science, or a related field (Master’s preferred but not mandatory).</li></ul><br/><br/><strong>Benefits</strong><br/><br/><ul><li>Hybrid working model with flexibility to work from home up to 3 days a week and a minimum of 2 days a week in the Sydney CBD office.</li><li>Exciting and rewarding team culture</li><li>Quarterly recognition awards</li><li>Business Casual dress code</li><li>Rewarding Employee Incentive Program</li><li>Growing company with progression opportunities</li></ul></div></div></div></section><section><div><h2>Employer questions</h2><div><span>Your application will include the following questions:</span><ul><li><div><span>Do you have full working rights in Australia? If yes, please specify.</span></div></li><li><div><span>What are your salary expectations? (Excluding Super)</span></div></li></ul></div></div></section><section></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/85990794?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">AI/ML Engineer</h1></div></div></div></div><div><div><div><div><div><span><a href=\"/Machine-Learning-Engineer-jobs/in-Richmond-VIC-3121\">Richmond, Melbourne VIC</a></span></div></div></div><div><div><div><span><a href=\"/jobs-in-information-communication-technology/engineering-software\">Engineering - Software (Information &amp; Communication Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Machine-Learning-Engineer-jobs/full-time\">Full time</a></span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/85990794/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div><p><strong>Role Overview</strong></p><p>We are seeking a hands-on and innovative<strong>AI Engineer</strong>to join the development and integration of AI tools across our EFD product suite. You will lead AI projects to design, build, and deploy AI models that automate data classification and decision-making tools using our proprietary early fault detection data and other data sources.</p><p>This technical role will allow you to work on a cutting-edge preventative or predictive maintenance system that will prevent outages and catastrophic events, such as wildfires started by electricity networks and infrastructure. You will also have the opportunity to work with world-leading data scientists in the energy and electricity domain in the US.</p><p><strong>Key Responsibilities</strong></p><ul><li><p><strong>AI Model Development &amp; Deployment</strong></p><ul><li><p>Design and implement machine learning models for time-series data classification and anomaly detection.</p></li><li><p>Manage model training, validation, and deployment to optimise and support field and asset inspection.</p></li></ul></li><li><p><strong>Data Management &amp; Insights</strong></p><ul><li><p>Work with advanced powerline sensor data to classify data sources and provide insights.</p></li><li><p>Collaborate with domain experts in the US and Australia to refine models based on real field data.</p></li></ul></li><li><p><strong>Team Building &amp; Mentorship</strong></p><ul><li><p>Collaborate with our AI and data science team to deliver AI tools to our customers and internal stakeholders.</p></li><li><p>Foster a culture of innovation, experimentation, and continuous learning.</p></li></ul></li></ul><p><strong>Qualifications &amp; Experience</strong></p><ul><li><p>Degree in Computer Science or related field (candidates with a PhD degree in ML or AI are preferred).</p></li><li><p>At least five years of experience in developing and deploying AI models in real-world production systems</p></li><li><p>Proven experience leading AI/ML projects from concept to production.</p></li><li><p>Strong background in machine learning, deep learning, and statistical modelling.</p></li><li><p>Proficiency in Python and ML frameworks (e.g., TensorFlow, PyTorch, Scikit-learn).</p></li><li><p>Experience with time-series data, sensor analytics, or industrial AI applications.</p></li><li><p>Familiarity with cloud platforms (AWS, Azure, GCP) and MLOps practices.</p></li><li><p>Excellent communication and leadership skills.</p></li></ul></div></div></div></section><section><div><h2>Employer questions</h2><div><span>Your application will include the following questions:</span><ul><li><div><span>Which of the following statements best describes your right to work in Australia?</span></div></li><li><div><span>How many years' experience do you have as a Machine Learning Engineer?</span></div></li><li><div><span>Have you worked in a role which requires experience with statistical modelling?</span></div></li><li><div><span>Have you worked in a role which requires experience with machine learning techniques?</span></div></li><li><div><span>Which of the following programming languages are you experienced in?</span></div></li></ul></div></div></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86373982?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">Contract Data Scientist (GenAI)</h1></div></div></div></div><div><div><div><div><div><span><a href=\"/Data-Scientist-jobs/in-Sydney-NSW-2000\">Sydney NSW</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-science-technology/other\">Other (Science &amp; Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Data-Scientist-jobs/contract-temp\">Contract/Temp</a></span></div></div></div><div><div><div><span>$900 - $1100 p.d.</span></div></div></div></div></div></div><div><section><div><div><div><p>We are seeking a skilled Contract Data Scientist with expertise in Generative AI (Gen AI) to support a range of projects across different industries.</p><p><strong>Client Details</strong></p><p>This organisation is a trusted and well-established company, known for it's commitment to delivering technology-enabled, high-quality solutions across a diverse client base. With a medium-sized footprint and a reputation for agility, the company excels in blending deep industry expertise with cutting-edge innovation. Its culture is defined by collaboration, creativity, and continuous improvement, making it a magnet for forward-thinking professionals who thrive in transformative environments.</p><p><strong>Description</strong></p><p>We're seeking a forward-thinking Generative AI Data Scientist to join our dynamic team on a contract basis. You'll be at the forefront of innovation, designing and deploying Gen AI solutions that transform how we work, create, and make decisions. If you thrive in fast-paced environments and love solving complex problems with cutting-edge tools, we want to hear from you.</p><p>Key Responsibilities:</p><ul><li>Develop and fine-tune Gen AI models for text, image, and code generation</li><li>Collaborate with cross-functional teams to integrate AI solutions into business work flows</li><li>Clean, structure, and analyse large data sets to support model training</li><li>Apply ML Ops best practices for saleable deployment and monitoring</li><li>Communicate insights and model outputs to technical and non-technical stakeholders</li></ul><p><strong>Profile</strong></p><ul><li>A degree in Data Science, Computer Science, Mathematics, or a related field.</li><li>Proven experience with Generative AI models and machine learning techniques.</li><li>Strong programming skills, particularly in Python or R, and familiarity with AI frameworks.</li><li>Experience working with cloud platforms such as AWS, Azure, or Google Cloud.</li><li>Excellent problem-solving and analytical abilities.</li><li>The ability to communicate complex technical concepts to non-technical stakeholders.</li><li>A proactive approach to staying ahead of emerging AI trends and tools.</li></ul><p><strong>Job Offer</strong></p><ul><li>Competitive daily rate</li><li>Collaborative and innovative work environment in Sydney.</li><li>Flexible working arrangements to suit your needs.</li><li>Chance to make a tangible impact on business outcomes through AI-driven solutions.</li><li>Opportunity to shape the future of AI in Australia</li></ul><p>If you're ready to take on this exciting challenge as a Contract Data Scientist (Gen-AI) in Sydney, we encourage you to apply today</p><p>To apply online please click the 'Apply' button below.</p></div></div></div></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86436790?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">Data Scientist</h1></div></div></div></div><div><div><div><div><div><span><a href=\"/Data-Scientist-jobs/in-Sydney-NSW-2000\">Sydney NSW</a>(Remote)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-science-technology/mathematics-statistics-information-sciences\">Mathematics, Statistics &amp; Information Sciences (Science &amp; Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Data-Scientist-jobs/full-time\">Full time</a></span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/86436790/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div><p><strong>Overview</strong></p><p>Hiring for<strong>two</strong>fully remote roles - work from anywhere in Australia.</p><p>The Data Scientist will join a highly skilled data science team and work directly with a talented team of software engineers, auditors, product managers and customer experience managers to analyze healthcare data and deliver value for our clients.</p><p><strong>Responsibilities in the role include</strong>:</p><p>· Apply Statistical/ Machine Learning techniques to build models for data product and features</p><ul><li><p>Analyse and present actionable insights to internal and external stakeholders to enable informed decision making</p></li></ul><p>· Understand and translate business requirements from internal and external stakeholders into data product and features</p><ul><li><p>Serve as a subject matter expert in data and analytics in client engagements to help our customers get increased value from our products</p></li><li><p>Develop scripts and packages to extract, transform and analyze large datasets</p></li></ul><p>· Collaborate with key internal stakeholders to productionise data science models and product features</p><p>· Generate reports and dashboards, to communicate key insights to internal and external stakeholders</p><p>· Develop Proof of Concepts and working demos</p><p><strong>Essential skills</strong>:</p><p>· Tertiary qualification in data science, mathematics, statistics, physics or other related fields</p><p>· 3+ years experience in a commercial advanced analytics environment.</p><p>· Solid skills in building statistical/data science models</p><p>· Solid skills in SQL for data extraction and manipulation</p><p>· Hands-on experience in python</p><p>· Excellent communication skills</p><p><strong>Desirable skills</strong>:</p><p>· Experience in healthcare industry highly regarded</p><p>· Familiarity with Amazon Web Services (AWS) applications (QuickSight, S3, Sagemaker, HealthLake)</p><p>· Experience with agile software development</p></div></div></div></section><section><div><h2>Employer questions</h2><div><span>Your application will include the following questions:</span><ul><li><div><span>Which of the following statements best describes your right to work in Australia?</span></div></li></ul></div></div></section><section></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86250512?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">Machine Learning Engineer</h1></div></div><div><div><div><div><div><span><a href=\"/Machine-Learning-Engineer-jobs/in-Sydney-NSW-2000\">Sydney NSW</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-information-communication-technology/developers-programmers\">Developers/Programmers (Information &amp; Communication Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Machine-Learning-Engineer-jobs/full-time\">Full time</a></span></div></div></div><div><div><div><span>$120,000 - $140,000 + Super + Bonus</span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/86250512/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div>Join a leading data-driven enterprise working at the forefront of retail innovation. As a<strong>Machine Learning Engineer</strong>, you’ll design, scale, and deploy production-grade ML solutions that solve complex business challenges and deliver tangible impact across high-traffic platforms.<br/><br/>This is an opportunity to work in a modern, cloud-native environment alongside top-tier Data Scientists and Engineers, using the latest in GCP technologies and orchestration tools.<br/><br/><strong>What You’ll Do:</strong><ul><li>Build, deploy, and maintain scalable ML pipelines using Google Cloud technologies.<br/><br/></li><li>Develop robust data models, APIs, and predictive solutions to solve business-critical problems.<br/><br/></li><li>Collaborate closely with cross-functional teams in an agile setting to deliver high-impact data products.<br/><br/></li><li>Champion engineering best practices, testing frameworks, and architectural reviews to ensure quality and reliability.<br/><br/></li><li>Drive innovation through continuous learning and the adoption of new technologies and frameworks.<br/><br/></li></ul><strong>What You’ll Bring:</strong><ul><li>Bachelor’s degree or higher in Computer Science, Engineering, or a related field.<br/><br/></li><li>3+ years of experience in commercial software development.<br/><br/></li><li>2+ years of hands-on experience with Python, SQL, and Linux environments.<br/><br/></li><li>Experience with ML orchestration tools such as Vertex AI Pipelines, Kubeflow, Argo, or Airflow.<br/><br/></li><li>Proficiency with Docker or Kubernetes for containerized deployments.<br/><br/></li><li>Familiarity with modern ML methods (e.g., GNNs, LLMs) and MLOps best practices.<br/><br/></li><li>Exposure to microservices architecture and tools like dbt core is a plus.<br/><br/></li></ul><strong>Why Join?</strong><ul><li>Be part of high-impact projects that blend data science and software engineering.<br/><br/></li><li>Work in a flexible, inclusive, and innovation-focused environment.<br/><br/></li><li>Access cutting-edge tools and cloud technologies.<br/><br/></li><li>Grow your career with continuous learning and hands-on experience in solving real-world problems.<br/><br/></li></ul></div></div></div></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86377660?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">AI Machine Learning Researcher</h1></div></div><div><div><div><div><div><span><a href=\"/Machine-Learning-Researcher-jobs/in-Perth-WA-6000\">Perth WA</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-information-communication-technology/engineering-software\">Engineering - Software (Information &amp; Communication Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Machine-Learning-Researcher-jobs/contract-temp\">Contract/Temp</a></span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/86377660/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div><p>Our client, a leading name in the education sector, is seeking an experienced AI / Machine Learning Researcher for an initial 3-month contract, with the potential for further 3-month extensions.<br/><br/>In this role, you will build upon and enhance existing video analytics capabilities, focusing on improving the accuracy, robustness, and efficiency of current models. This position uniquely combines applied AI research with real-world traffic engineering and safety analysis, offering the opportunity to work on impactful projects at the intersection of cutting-edge technology and transportation safety.</p><p><strong><br/>Key Responsibilities:</strong></p><ul><li>Investigate, benchmark, and optimise model architectures for detection, segmentation, and tracking in complex transport environments.</li><li>Enhance multi-object tracking pipelines using advanced methods such as DeepSORT, ByteTrack, and Transformer-based approaches.</li><li>Improve video analytics performance through evaluation of alternative models and pipeline optimisation.</li><li>Develop post-processing logic for trajectory denoising, smoothing, and error reduction.</li><li>Apply denoising techniques to improve low-resolution or low-bitrate footage.</li><li>Conduct field validation of model performance across diverse environments and camera types.</li><li>Support camera calibration workflows for accurate spatial measurements.</li><li>Run ablation studies and model evaluations under varied environmental conditions.</li><li>Collaborate with cloud engineering teams for scalable inference deployment using ONNX, TensorRT, Triton, or similar.</li><li>Translate AI outputs into transport safety and engineering metrics.</li><li>Contribute to documentation, reports, and publications.</li></ul><p><strong><br/>Essential Criteria:</strong></p><ul><li>PhD in Computer Science, Applied Mathematics, Robotics, Physics, or related discipline; or equivalent experience with a strong applied AI/computer vision track record.</li><li>Expertise in object detection, segmentation, and multi-object tracking in complex scenarios.</li><li>Proficiency with deep learning frameworks (PyTorch, TensorFlow) and Python libraries (OpenCV, Yolo, NumPy, scikit-learn).</li><li>Proven experience in real-world video analytics and model deployment under challenging conditions.</li><li>Experience with model optimisation and inference acceleration.</li><li>Familiarity with denoising techniques for low-quality video.</li><li>Understanding of camera calibration and spatial measurement.</li><li>Strong communication skills and ability to work independently and in multi-disciplinary teams.</li></ul><p><strong><br/>Desirable:</strong></p><ul><li>GPU-based inference deployment (ONNX, TensorRT, Triton).</li><li>Knowledge of transport/traffic datasets.</li><li>Track record of publications or open-source contributions.</li><li>MLOps tools and practices (MLflow, Weights &amp; Biases).</li><li>Experience with Transformer architectures for video data.</li></ul><p>To be considered for the role click the 'apply' button or for more information about this and other opportunities please contact Nicole Oo via email:<a href=\"/cdn-cgi/l/email-protection#e18f8e8ea19180999492cf828e8ccf8094\"><span>[email protected]</span></a></p><p>Paxus values diversity and welcomes applications from Indigenous Australians, people from diverse cultural and linguistic backgrounds and people living with a disability. If you require an adjustment to the recruitment process, including the application form in an alternate format, please contact me on the above contact details.</p></div></div></div></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  },
  "https://www.seek.com.au/job/86377703?type=standard&ref=search-standalone&origin=cardTitle": {
    "job_content": "<html><body><div role=\"main\"><div><div><div><div><div><div><div><div><div><h1 data-automation=\"job-detail-title\">Senior-Lead Data/Machine Learning Engineer</h1></div></div><div><div><div><div><div><span><a href=\"/Machine-Learning-Engineer-jobs/in-Sydney-NSW-2000\">Sydney NSW</a>(Hybrid)</span></div></div></div><div><div><div><span><a href=\"/jobs-in-information-communication-technology/engineering-software\">Engineering - Software (Information &amp; Communication Technology)</a></span></div></div></div><div><div><div><span><a href=\"/Machine-Learning-Engineer-jobs/full-time\">Full time</a></span></div></div></div><div><div><div><span>$190,000 - $210,000 + Super</span></div></div></div></div></div><div><div><div><div><div><div><div><a href=\"/job/86377703/apply\"><span><span><span>Quick apply</span></span></span></a></div></div></div></div></div></div></div></div><div><section><div><div><div><p><strong>Senior &amp; Lead Responsibilities</strong></p><ul><li>Collaborate with stakeholders to design and deliver scalable, ML/AI-enabled applications.</li><li>Develop, train, and deploy<strong>custom ML models</strong>from proof of concept to production.</li><li>Integrate ML solutions into full-stack applications, ensuring performance and maintainability.</li><li>Solve complex data challenges from ingestion, transformation, modelling, and serving at enterprise scale.</li><li>Present technical concepts clearly to both technical and business audiences.</li></ul><p><strong>Lead (additional)</strong></p><ul><li>Own delivery from scope to deployment, including solution architecture and technical direction.</li><li>Shape and run proof-of-concepts, estimations, and delivery plans.</li><li>Influence product and technical strategy with senior stakeholders.</li></ul><p><strong>Technical Skills Required</strong></p><p><strong>Essential</strong></p><ul><li>Strong<strong>software engineering background</strong>, ideally full stack.</li><li>End-to-end ML project experience: model design, training, validation, deployment, monitoring.</li><li>Expertise in<strong>AWS</strong>(SageMaker, Bedrock, Step Functions).</li><li>Proficiency in<strong>TensorFlow</strong>or<strong>PyTorch</strong>, Python, and MLOps best practices.</li><li>Background in<strong>data engineering</strong>and/or<strong>data architecture</strong>.</li><li>Depth in at least<strong>two ML domains</strong>(e.g. recommendation systems, NLP, computer vision, structured data prediction, GenAI).</li></ul><p><strong>Nice to Have</strong></p><ul><li>Understanding of<strong>LLMs, RAGs, AI Agents</strong>(conceptual knowledge is enough).</li><li>Experience with other cloud ML platforms (Vertex AI, Azure ML).</li><li>Experience influencing technical and product direction before delivery</li></ul><p>If you are keen to not sit in silo and work on next generaltional technical problems across Data, Software, AI &amp; Machine Learning projects, get in touch.</p><p><strong>Please note: This position requires Australian Permanent Residency/Citizenship &amp; to be located in Sydney or Melbourne</strong></p></div></div></div></section><section><div><div><span>Don’t provide your bank or credit card details when applying for jobs.</span></div></div></section><section></section></div></div></div></div></div></div></div></div></body></html>"
  }
}